j20-immigration/j20-immigration.org
#+OPTIONS: broken-links:t todo:nil
#+AUTHOR: Hawaii J20
#+hugo_base_dir: /home/dk/Public/projects/958-web-site/public-node/j20-immigration/
#+hugo_auto_set_lastmod: t
** Why should we worry about people different than us?
   :PROPERTIES:
   :EXPORT_FILE_NAME: waste-time
   :EXPORT_DATE: 2018-06-12
   :EXPORT_AUTHOR: "Hawaii J20"
   :EXPORT_HUGO_MENU: :menu "main"
   :END:

*** Question
Why should we waste time worrying about undocumented immigrants?

*** Answer
Hawai`i has a rich immigrant heritage that continues and should be allowed
continue, despite any risk of losing a small amount of federal grant money. Most
of us who live in Hawaii are either immigrants or the descendants of immigrants
who sought better lives for themselves and their children. Immigrants have
contributed significantly to our society and the unique character of Hawaii’s
culture. Today’s immigrants, whether documented or not, are no different.
