j20-immigration/content/post/waste-time.md
+++
title = "Why should we worry about people different than us?"
author = ["Hawaii J20"]
date = 2018-06-12
lastmod = 2018-06-13T14:11:31-10:00
draft = false
[menu.main]
  weight = 2011
  identifier = "why-should-we-worry-about-people-different-than-us"
+++

## Question {#question}

Why should we waste time worrying about undocumented immigrants?


## Answer {#answer}

Hawai\`i has a rich immigrant heritage that continues and should be allowed
continue, despite any risk of losing a small amount of federal grant money. Most
of us who live in Hawaii are either immigrants or the descendants of immigrants
who sought better lives for themselves and their children. Immigrants have
contributed significantly to our society and the unique character of Hawaii’s
culture. Today’s immigrants, whether documented or not, are no different.
